import '../models/allah_name.dart';

class AllahNames {
  AllahNames._();

  static const List<AllahName> all = [
    AllahName(
      number: 1,
      arabic: 'الله',
      transliteration: 'Аллоҳ',
      meaning: 'Аллоҳ, Худо, ягона Худо',
      description:
          'Аллоҳ лафзи «алаҳа» феълидан олинган «илоҳ» масдарига мансуб бўлиб маъбуд - ибодат қилинган зот - маъносини англатади. Арабларда «илоҳ»нинг аввалига алиф ва лом ҳарфлари киритилган ва «ал-илоҳу» ҳосил бўлган. Сўнгра ҳамзанинг ҳаракатини ломи таърифга нақл қилинган ва бир жинсдаги икки ҳарфни идғом қилингандан кейин «Аллоҳ» лафзи ҳосил бўлган.\nАллоҳ лафзи яккаю ягона маъбуди ҳаққа исм бўлиб қолган. У зотдан бошқага бу исм ишлатилмаган.\nБаъзи уламолар, Аллоҳ исми аъзамдир, деганлар. Бу лафзи жалола ҳақида Ибн Атоуллоҳ Сакандарий каби зотлар алоҳида китоблар ҳам ёзганлар.',
    ),
    AllahName(
      number: 2,
      arabic: 'الرحمن',
      transliteration: 'ар-Раҳмон',
      meaning: 'Меҳрибон',
      description:
          '«Раҳмон» – улуғ неъматларни берувчи.\n«Раҳмон» сифати фақат Аллоҳга хос бўлиб, барчага–кофирга ҳам, мўминга ҳам меҳрибон ва неъмат берувчи, маъносини англатади. Раҳмон сифатини Аллоҳ таолодан бошқа ҳеч кимга нисбатан ишлатиб бўлмайди.',
    ),
    AllahName(
      number: 3,
      arabic: 'الرحيم',
      transliteration: 'ар-Раҳийм',
      meaning: 'Раҳмдил',
      description:
          '«Роҳийм» – латиф неъматларни берувчи.\n«Роҳийм» сифати эса хосроқ бўлиб, қиёмат куни фақат мўминларга раҳм қилувчи маъносини англатади ва Аллоҳдан ўзгаларга, жумладан, Пайғамбар алайҳиссаломга нисбатан ҳам ишлатилади.',
    ),
    AllahName(
      number: 4,
      arabic: 'الملك',
      transliteration: 'ал-Малик',
      meaning: 'Подшоҳ, барча нарсанинг Эгаси',
      description:
          '«Малик» – барча нарсанинг эгаси.\n«Малик» – ҳақиқий эгадир, Ундан ўзга эга йўқ. Шунинг учун бандалар фақат Унга қул бўладилар. Ҳеч вақтда бир қулга икки хўжа бўлмайди. Шунинг учун инсонлар ўзларига ўхшаган инсонларга эмас, балки ягона яратганга, ҳақиқий эга-Маликка қул бўлишлари лозим.',
    ),
    AllahName(
      number: 5,
      arabic: 'القدوس',
      transliteration: 'ал-Қуддус',
      meaning: 'Муқаддас мутлақ Пок',
      description:
          '«Қуддус» - барча айблардан ҳоли, нолойиқ сифатлардан пок. Мутлақ муқаддаслик ва мутлақ поклик Аллоҳнинг Ўзигагина хосдир.',
    ),
    AllahName(
      number: 6,
      arabic: 'السلام',
      transliteration: 'ас-Салом',
      meaning: 'Тинчлик ва хавфсизлик ато этувчи, тинчлик ўрнатувчи',
      description:
          '«Салом» - нуқсонлардан саломат, шунингдек, тинчлик-хотиржамлик ва роҳат берувчи зот. Аллоҳ «Салом» сифати ила бандаларга тинчлик, омонлик, хотиржамлик ато қилади.',
    ),
    AllahName(
      number: 7,
      arabic: 'المؤمن',
      transliteration: 'ал-Мўмин',
      meaning: 'Содиқ, Ишончли, Иймон ато этувчи',
      description: 'Мўмин - иймон ва омонликни берувчи.',
    ),
    AllahName(
      number: 8,
      arabic: 'المهيمن',
      transliteration: 'ал-Муҳаймин',
      meaning: 'Қўриқчи, Сақловчи, Ҳимоячи',
      description:
          '«Муҳаймин» - ҳамма нарсани қамраб олувчи, яъни, Аллоҳ бандаларинг барча ҳолатларига гувоҳ бўлиб туради, Ундан ҳеч нарса махфий қолмайди.',
    ),
    AllahName(
      number: 9,
      arabic: 'العزيز',
      transliteration: 'ал-Азиз',
      meaning: 'Энг кучли, Буюк, Ғолиб',
      description:
          'Азиз - барчанинг устидан ғолиб. Ундан бирор нарса ғолиб кела олмайди.',
    ),
    AllahName(
      number: 10,
      arabic: 'الجبار',
      transliteration: 'ал-Жаббор',
      meaning: 'Энг қудратли, Бўйсундирувчи, Енгилмас',
      description:
          'Жаббор - олий қадар, улуғ, Унинг олдида ўзгалар ўзини хор тутади.',
    ),
    AllahName(
      number: 11,
      arabic: 'المتكبر',
      transliteration: 'ал-Мутакаббир',
      meaning: 'Кибриёси маболағали, энг Олий, Улуғ',
      description:
          'Мутакаббир - кибирёси ва улуғлиги муболағали зот. Унинг олдида бошқалар қул бўлиб турадиган зот.',
    ),
    AllahName(
      number: 12,
      arabic: 'الخالق',
      transliteration: 'ал-Холиқ',
      meaning: 'Яратувчи',
      description:
          'Холиқ - Асли ва ўхшаши йўқ нарсаларни аниқ бир ўлчовлар билан яратувчи. У зотда махлуқи йўқлигида ҳам Холиқлик маъноси мавжуддир. Аллоҳ махлуқлар вужудга келтирилишидан олдин Холиқ, деган васфга эга эди. У халойиқни халқ қилганидан бошлаб Холиқ исмини олгани йўқ. Холиқ мутлақ вужудга келтирувчидир.',
    ),
    AllahName(
      number: 13,
      arabic: 'البارئ',
      transliteration: 'ал-Бориъ',
      meaning: 'Ёқдан пайдо Қилувчи',
      description:
          'Бориъ - йўқдан пайдо қилувчи, вужудга келтирувчи.\nБориъ тафовутсиз қилиб вужудга келтирувчидир.',
    ),
    AllahName(
      number: 14,
      arabic: 'المصور',
      transliteration: 'ал-Мусаввир',
      meaning: 'Шакллантирувчи, суврат Берувчи',
      description:
          'Мусаввир - махлуқотларнинг сувратини шаклланти-рувчи. Ҳар бир нарсага ўзига хос суврат берувчи.',
    ),
    AllahName(
      number: 15,
      arabic: 'الغفار',
      transliteration: 'ал-Ғаффор',
      meaning: 'Мағфират Қилувчи, гуноҳларни Яширувчи',
      description:
          'Кўплаб мағфират қилиб, бандаларнинг айбини Ўз фазли ила уларни итоб қилмасдан кечиб юборувчи.',
    ),
    AllahName(
      number: 16,
      arabic: 'القهار',
      transliteration: 'ал-Қаҳҳор',
      meaning: 'Ҳукмдор, Бўйсундирувчи',
      description:
          'Барча махлуқотларни қабзасида тутиб, уларни Ўз ҳукмига юритиб ва қудрати ила бўйсундириб турувчи.',
    ),
    AllahName(
      number: 17,
      arabic: 'الوهاب',
      transliteration: 'ал-Ваҳҳоб',
      meaning: 'Беҳисоб, эвазсиз Берувчи, Энг саҳоватли',
      description: 'Кўплаб неъматларни беҳисоб берувчи.',
    ),
    AllahName(
      number: 18,
      arabic: 'الرزاق',
      transliteration: 'ар-Раззоқ',
      meaning: 'Ризқ-насиба, озуқа Берувчи',
      description:
          'Кўплаб ризқ берувчи. Ризқларни ва уларнинг воситаларини яратувчи. Аллоҳ махлуқотларига ҳеч бир оІирликсиз ва қийинчиликсиз ёки ёрдам сўрамасдан ризқ берувчидир.',
    ),
    AllahName(
      number: 19,
      arabic: 'الفتاح',
      transliteration: 'ал-Фаттоҳ',
      meaning: 'Очувчи, ғалаба Берувчи, Ҳакам',
      description:
          'Кўплаб нарсаларни очувчи. Ўз раҳмат хазийнасини бандаларига очувчи.',
    ),
    AllahName(
      number: 20,
      arabic: 'العليم',
      transliteration: 'ал-Алийм',
      meaning: 'Ҳамма нарсани Билувчи',
      description:
          'Ҳар бир нарсани билувчи. Бўлган ва бўладиган, аввалги ва охирги, зоҳир ва ботин нарсаларнинг барчасини билувчи.',
    ),
    AllahName(
      number: 21,
      arabic: 'القابض',
      transliteration: 'ал-Қобиз',
      meaning: 'Камайтирувчи, Чекловчи, жон Олувчи',
      description:
          'Руҳларни қабз қилувчи - тутувчи. Хоҳлаган кишисининг ризқини қабз қилувчи. Қалбларни қабз қилувчи.',
    ),
    AllahName(
      number: 22,
      arabic: 'الباسط',
      transliteration: 'ал-Босит',
      meaning: 'Кўпайтирувчи, Тарқатувчи, Кенгайтирувчи',
      description:
          'Руҳларни кенгликка қўйиб юборувчи. Хоҳлаган кишисининг ризқини кенг қилиб қўювчи. Қалбларни кенг қилувчи.',
    ),
    AllahName(
      number: 23,
      arabic: 'الخافض',
      transliteration: 'ал-Хофиз',
      meaning: 'Пасайтирувчи, Камситувчи, Хўрловчи',
      description:
          'Пасайтирувчи. Мисол учун кофир ва фосиқларнинг мартабасини уларни хору зор қилиб пасайтиради.',
    ),
    AllahName(
      number: 24,
      arabic: 'الرافع',
      transliteration: 'ар-Рофеъ',
      meaning: 'Юксалтирувчи, Кўтарувчи',
      description:
          'Кўтарувчи. Мисол учун мўмин ва тақводорларнинг мартабасини уларни азизу мукаррам қилиб кўтаради.',
    ),
    AllahName(
      number: 25,
      arabic: 'المعز',
      transliteration: 'ал-Муъизз',
      meaning: 'Азиз қилувчи, шон-шараф, куч-қувват Берувчи',
      description: 'Азиз қилувчи. Кимни хоҳласа тўғри йўлга солиб азиз қилади.',
    ),
    AllahName(
      number: 26,
      arabic: 'المذل',
      transliteration: 'ал-Музилл',
      meaning: 'Хор қилувчи, Заифлаштирувчи, қувват Олувчи',
      description:
          'Хор қилувчи. Кимни хоҳласа эгри йўлга юргани учун хор қилади.',
    ),
    AllahName(
      number: 27,
      arabic: 'السميع',
      transliteration: 'ас-Самийъ',
      meaning: 'Ҳар бир нарсани Эшитувчи',
      description: 'Ҳар бир нарсани эшитувчи.',
    ),
    AllahName(
      number: 28,
      arabic: 'البصير',
      transliteration: 'ал-Басийр',
      meaning: 'Ҳар бир барсани Кўрувчи',
      description: 'Ҳар бир нарсани кўрувчи.',
    ),
    AllahName(
      number: 29,
      arabic: 'الحكم',
      transliteration: 'ал-Ҳакам',
      meaning: 'Ҳакам, олий Ҳакам, Ҳал қилувчи',
      description: 'Ҳукм қилувчи.',
    ),
    AllahName(
      number: 30,
      arabic: 'العدل',
      transliteration: 'ал-Адл',
      meaning: 'Адолатли, Мутлақ адолат қилувчи',
      description: 'Мутлақ адолат қилувчи.',
    ),
    AllahName(
      number: 31,
      arabic: 'اللطيف',
      transliteration: 'ал-Латийф',
      meaning: 'Меҳрибон, чуқур Билгувчи, Лутф кўрсатувчи',
      description:
          'Ўта лутф кўрсатувчи. Барча нарсаларнинг нозик ва дақиқ жойларигача билувчи.',
    ),
    AllahName(
      number: 32,
      arabic: 'الخبير',
      transliteration: 'ал-Хабийр',
      meaning: 'Ҳаммас нарсани Билувчи, ўта Хабардор',
      description: 'Ҳамма нарсадан ўта хабардор.',
    ),
    AllahName(
      number: 33,
      arabic: 'الحليم',
      transliteration: 'ал-Ҳалийм',
      meaning: 'Иқоб, қилишга Шошилмайдиган, Кечиримли, Меҳрибон',
      description: 'Ғазаби қўзимайдиган ва иқоб қилишга шошилмайдиган.',
    ),
    AllahName(
      number: 34,
      arabic: 'العظيم',
      transliteration: 'ал-Азийм',
      meaning: 'Азаматли ва Улуғ',
      description: 'Ақл тасаввур қила олмайдиган даражада азаматли ва улуғ.',
    ),
    AllahName(
      number: 35,
      arabic: 'الغفور',
      transliteration: 'ал-Ғафур',
      meaning: 'Кечиримли, Ўта мағфиратли',
      description: 'Кўп мағфират қилувчи.',
    ),
    AllahName(
      number: 36,
      arabic: 'الشكور',
      transliteration: 'аш-Шакур',
      meaning: 'Шукр Эгаси, савоб Берувчи',
      description: 'Оз амал учун кўп савоб берувчи.',
    ),
    AllahName(
      number: 37,
      arabic: 'العلي',
      transliteration: 'ал-Алий',
      meaning: 'Энг Олий, Мартабаси бениҳоя',
      description: 'Мартабаси олийликда бениҳоя.',
    ),
    AllahName(
      number: 38,
      arabic: 'الكبير',
      transliteration: 'ал-Кабийр',
      meaning: 'Энг Катта, Буюк',
      description: 'Ҳар бир нарсадан катта.',
    ),
    AllahName(
      number: 39,
      arabic: 'الحفيظ',
      transliteration: 'ал-Ҳафийз',
      meaning: 'Муҳофаза қилувчи, Ҳимоячи, Кузатувчи',
      description: 'Ҳар бир нарсани комил муҳофаза қилувчи.',
    ),
    AllahName(
      number: 40,
      arabic: 'المقيت',
      transliteration: 'ал-Муқийт',
      meaning: 'Ризқ Берувчи, Қўллаб-қувватловчи',
      description: 'Барча моддий ва руҳий қутларни яратувчи.',
    ),
    AllahName(
      number: 41,
      arabic: 'الحسيب',
      transliteration: 'ал-Ҳасийб',
      meaning: 'Ҳисобга олувчи, Ҳисоб қилувчи, Кифоя қилувчи',
      description: 'Кифоя қилувчи. Қиёмат куни бандаларнинг ҳисобини қилувчи.',
    ),
    AllahName(
      number: 42,
      arabic: 'الجليل',
      transliteration: 'ал-Жалийл',
      meaning: 'Улуғ Зот',
      description: 'Сифатларида улуғликка эга бўлган зот.',
    ),
    AllahName(
      number: 43,
      arabic: 'الكريم',
      transliteration: 'ал-Карийм',
      meaning: 'Саҳоватли, Меҳрибон, кўплаб ато қилувчи',
      description:
          'Биров сўрамаса ҳам, бирор нарсанинг эвазига бўлмаса ҳам нарсаларни кўплаб ато қилувчи. Лутф билан итоб қилувчи. Қарама-қаршиликлардан пок бўлган. Карамли ишлар ва хислатлар соҳиби.',
    ),
    AllahName(
      number: 44,
      arabic: 'الرقيب',
      transliteration: 'ар-Рақийб',
      meaning: 'Кузатиб, муроқаба қилиб турувчи',
      description: 'Ҳеч бир заррани ҳам қўймай муроқаба қилиб турувчи.',
    ),
    AllahName(
      number: 45,
      arabic: 'المجيب',
      transliteration: 'ал-Мужийб',
      meaning: 'Дуоларни Қабул этувчи, Ижобат қулувчи',
      description: 'Дуоларни ижобат қилувчи.',
    ),
    AllahName(
      number: 46,
      arabic: 'الواسع',
      transliteration: 'ал-Восеъ',
      meaning: 'Кенг, ҳамма нарсани Қамраб олувчи',
      description:
          'Кенг – ҳамма нарсани кенг илми ила қамраб олган. Барчани кенг раҳмати ила қамраб олган.',
    ),
    AllahName(
      number: 47,
      arabic: 'الحكيم',
      transliteration: 'ал-Ҳакийм',
      meaning: 'Ҳикмат ила қилувчи',
      description: 'Ҳар бир нарсани ҳикмат ила қилувчи.',
    ),
    AllahName(
      number: 48,
      arabic: 'الودود',
      transliteration: 'ал-Вадуд',
      meaning: 'Яхши кўрувчи, Севимли',
      description: 'Барчага яхшиликни раво кўрувчи.',
    ),
    AllahName(
      number: 49,
      arabic: 'المجيد',
      transliteration: 'ал-Мажийд',
      meaning: 'Қадри баланд, Шон-шарафи чексиз',
      description: 'Шон - шарафи ва қадри баланд ва чексиз.',
    ),
    AllahName(
      number: 50,
      arabic: 'الباعث',
      transliteration: 'ал-Боъис',
      meaning: 'Қайта Тирилтирувчи, ҳиммат Юборувчи',
      description:
          'Юборувчи: халқларга пайғамбарлар юборувчи. Кишиларга ҳиммат юборувчи. Ўликларни қайта тирилтирувчи.',
    ),
    AllahName(
      number: 51,
      arabic: 'الشهيد',
      transliteration: 'аш-Шаҳийд',
      meaning: 'Гувоҳлик берувчи, Ҳозиру нозир',
      description: 'Ҳар бир нарсага ҳозиру нозир. Барчага шоҳидлик берувчи.',
    ),
    AllahName(
      number: 52,
      arabic: 'الحق',
      transliteration: 'ал-Ҳақ',
      meaning: 'Ҳақ, Ҳақиқатни юзага чиқарувчи, Адолатли',
      description: 'Ўзгармас собит зот. Ҳақни юзага чиқарувчи зот.',
    ),
    AllahName(
      number: 53,
      arabic: 'الوكيل',
      transliteration: 'ал-Вакийл',
      meaning: 'Ишончли, Ҳимоя қилувчи',
      description: 'Барчанинг иши унга топширилган зот.',
    ),
    AllahName(
      number: 54,
      arabic: 'القوي',
      transliteration: 'ал-Қавий',
      meaning: 'Қувватли, Кучли',
      description: 'Қувватли зот.',
    ),
    AllahName(
      number: 55,
      arabic: 'المتين',
      transliteration: 'ал-Матийн',
      meaning: 'Матонатли, ўта Бардошли',
      description: 'Матонатли зот.',
    ),
    AllahName(
      number: 56,
      arabic: 'الولي',
      transliteration: 'ал-Валий',
      meaning: 'Ҳимоячи, Йўлдош, Ёрдамчи',
      description:
          'Муҳаббат қилувчи, нусрат берувчи ва халқининг ишини юритувчи зот.',
    ),
    AllahName(
      number: 57,
      arabic: 'الحميد',
      transliteration: 'ал-Ҳамийд',
      meaning: 'Мақтовга лойиқ',
      description: 'Барча мақтовлар ила мақталган зот.',
    ),
    AllahName(
      number: 58,
      arabic: 'المحصي',
      transliteration: 'ал-Муҳсий',
      meaning: 'Ҳисоб қилувчи, Ҳисобга олувчи',
      description: 'Барча нарсанинг ҳисобини олган зот.',
    ),
    AllahName(
      number: 59,
      arabic: 'المبدئ',
      transliteration: 'ал-Мубдиъ',
      meaning: 'Асос солувчи, Яратувчи',
      description: 'Барча нарсаларни аввал бошдан бор қилган зот.',
    ),
    AllahName(
      number: 60,
      arabic: 'المعيد',
      transliteration: 'ал-Муъийд',
      meaning: 'Қайтарувчи, қайта Тикловчи',
      description: 'Йўқ бўлган нарсаларни яна қайтадан бор қилувчи.',
    ),
    AllahName(
      number: 61,
      arabic: 'المحيي',
      transliteration: 'ал-Муҳйи',
      meaning: 'Ҳаёт берувчи, тирилтирувчи, Жонлантирувчи',
      description:
          'Тирилтирувчи. У зот ўликларни тирилтирувчидир ва бу исмга уларни тирилтиришдан олдин сазовордир. Уни уларни ўлик бўлганларидан кейин жон киритиб тирик қилганидан кейин тирилтирувчи, деб аталганидек, уларни халқ қилишдан олдин, уларга ҳаёт беришидан олдин ҳам, тирилтирувчи, дейилаверади. Худди, халойиқни халқ қилишидан олдин Холиқ бўлганидек. Аллоҳ таолога қиёмат куни ўликларни тирилтириши учун, тирилтирувчи номи берилди. Бас, шундан маълум бўлдики, тирилтириш сифати Аллоҳ таоло учун тирилтиришдан олдин ҳам собитдир.',
    ),
    AllahName(
      number: 62,
      arabic: 'المميت',
      transliteration: 'ал-Мумийт',
      meaning: 'Ўлдирувчи',
      description: 'Ўлдиривчи. Барча жонзотларнинг жонини олувчи.',
    ),
    AllahName(
      number: 63,
      arabic: 'الحي',
      transliteration: 'ал-Ҳайй',
      meaning: 'Тирик, Адабий Барҳаёт',
      description:
          'Тирик. У тирикдир, ўлмас. Яъни, Аллоҳнинг ҳаёти абадийдир, ўлим ила йўқ бўлмас. Шунингдек, Аллоҳнинг ҳаёти азалийдир, олдиндан йўқ бўлган эмас.\nЯгона Аллоҳнинг тириклиги Ўзигагина хос алоҳида ҳаёт бўлиб, бандалар ҳаётига ўхшаш бошқа масдардан берилган эмас. Бу ҳаёт азалий ва абадийдир. Бошланиш чегараси ҳам, тугаш чегараси ҳам йўқ. Аллоҳнинг тириклиги ҳеч бир жиҳатдан бандаларнинг ҳаётига ўхшамайди.',
    ),
    AllahName(
      number: 64,
      arabic: 'القيوم',
      transliteration: 'ал-Қаййум',
      meaning: 'Беҳожат, Қоим қилувчи',
      description:
          'Ўз ўзидан қоим бўлган ва бошқаларни қоим қилган зот.\n«Қайюм»лик сифатининг маъноси, Аллоҳ таборак ва таолонинг ҳар бир нарса устида турувчи эканлиги ва ҳар бир турувчи нарса Унинг сабабидангина туришидир. Шу билан Аллоҳнинг туриши бошқаникига ўхшамайди ва доимийдир.',
    ),
    AllahName(
      number: 65,
      arabic: 'الواجد',
      transliteration: 'ал-Вожид',
      meaning: 'Бой, Топувчи',
      description:
          'Топувчи. Хоҳлаган нарсасини топувчи. Бу ишда биров Уни тўса олмайди.',
    ),
    AllahName(
      number: 66,
      arabic: 'الماجد',
      transliteration: 'ал-Можид',
      meaning: 'Мажду-шараф соҳиби, Шон-шарафли',
      description: 'Мажду шараф соҳиби бўлган зот.',
    ),
    AllahName(
      number: 67,
      arabic: 'الواحد',
      transliteration: 'ал-Воҳид',
      meaning: 'Яккаю-ягона, Битта',
      description:
          'Ягона. Бита. Бўлинмас. У зот ўз зотида ҳам, сифатларида ҳам ва ишларида ҳам бирдир.',
    ),
    AllahName(
      number: 68,
      arabic: 'الصمد',
      transliteration: 'ас-Сомад',
      meaning: 'Эҳтиёжсиз, Азалий',
      description:
          'Сомад сифати кўп маъноларни ўз ичига олади:\n- итоат қилинган улуғ–Усиз ҳеч бир иш битмайди.\n- ҳеч кимга ҳожати тушмайди, барчанинг ҳожати Унга тушади.\n- бутун махлуқот битиб тугаса ҳам, Ўзи доим боқийдир ва ҳоказо.',
    ),
    AllahName(
      number: 69,
      arabic: 'القادر',
      transliteration: 'ал-Қодир',
      meaning: 'Қудратли, чексиз қудрат соҳиби',
      description:
          'Чексиз қудрат соҳиби. У зот ҳар бир нарсага қодирдир. Ъар бир иш унга осондир.\nАллоҳ таоло азалдан ҳар бир нарсага қодирдир. Агар Аллоҳ азалдан ҳар бир нарсага қодир бўлмаса, қачон ва қандоқ қилиб ҳар бир нарсага қодир бўла олади.\nАҳли сунна ва жамоа эса Аллоҳ ҳар бир нарсага қодирдир. Бунга ҳамма бўлиши мумкин нарсалар киради. Бўлиши мумкин бўлмаган амри маҳол нарсаларга эса ақли бор одамлар аҳамият бермайдилар, дейдилар.\nБаъзи бир фитначи одамлар мусулмонларнинг иймонига футур етказиш учун «Аллоҳ ўзи кўтаролмайдиган тошни ҳам ярата оладими?» каби бемаъни саволларни берадилар. Бу каби нарсалар амри маҳолдир ва аҳли иймонлар уларга аҳамият бермасликлари лозим.',
    ),
    AllahName(
      number: 70,
      arabic: 'المقتدر',
      transliteration: 'ал-Муқтадир',
      meaning: 'Жуда ҳам қудратли, ўта Кучли',
      description: 'Жуда ҳам қудратли.',
    ),
    AllahName(
      number: 71,
      arabic: 'المقدم',
      transliteration: 'ал-Муқаддим',
      meaning: 'Олдинга сурувчи, Яқинлаштирувчи',
      description:
          'Олдинга сурувчи. У зот хоҳлаган шахс ва нарсани хоҳлаганидан олдинга суради.',
    ),
    AllahName(
      number: 72,
      arabic: 'المؤخر',
      transliteration: 'ал-Муаххир',
      meaning: 'Орқага сурувчи, Орқага қайтарувчи',
      description:
          'Орқага сурувчи. У зот хоҳлаган шахс ва нарсани хоҳлаганидан орқага суради.',
    ),
    AllahName(
      number: 73,
      arabic: 'الأول',
      transliteration: 'ал-Аввал',
      meaning: 'Барча нарсадан аввал, Бошланишсиз',
      description:
          '«Аввал» - У ҳамма нарсадан аввал, яъни, барча мавжудотлар йўқлигида Аллоҳ бор эди. Мавжудотларни «Аввал» сифатига эга бўлган Аллоҳ яратди. Яъни, Аллоҳ вужудга келишининг бошланиши йўқдир.',
    ),
    AllahName(
      number: 74,
      arabic: 'الآخر',
      transliteration: 'ал-Охир',
      meaning: 'Сўнгги, Охири йўқ',
      description: '«Охир» - У ҳамма нарса йўқ бўлиб кетганда ҳам Ўзи қолади.',
    ),
    AllahName(
      number: 75,
      arabic: 'الظاهر',
      transliteration: 'аз-Зоҳир',
      meaning: 'Ошкор, Очиқ-ойдин',
      description:
          '«Зоҳир» - Унинг мавжудлиги ошкор, очиқ-ойдиндир. У ҳамма нарсадан зоҳир-устундир.',
    ),
    AllahName(
      number: 76,
      arabic: 'الباطن',
      transliteration: 'ал-Ботин',
      meaning: 'Махфий, Яширин',
      description:
          '«Ботин» - У кўзга кўринмайди. Ҳаммадан пинҳон-махфий нарсаларни билиб турувчидир.',
    ),
    AllahName(
      number: 77,
      arabic: 'الوالي',
      transliteration: 'ал-Волий',
      meaning: 'Ҳукмдор, ҳар бир нарсанинг Эгаси, Волий',
      description: 'Ҳар бир нарсага волий - эга бўлган зот.',
    ),
    AllahName(
      number: 78,
      arabic: 'المتعالي',
      transliteration: 'ал-Мутаъолий',
      meaning: 'Юқори турувчи, Устун, энг Олий',
      description: 'Нуқсонлардан юқори турувчи зот.',
    ),
    AllahName(
      number: 79,
      arabic: 'البر',
      transliteration: 'ал-Барр',
      meaning: 'Яхши, Раҳмли, Яхшилик қилувчи',
      description: 'Улуғ яхшилик қилувчи.',
    ),
    AllahName(
      number: 80,
      arabic: 'التواب',
      transliteration: 'ат-Таввоб',
      meaning: 'Тавбани қабул қилувчи',
      description:
          'Бандаларни тавбага йўлловчи ва уларнинг тавбасини кўплаб қабул қилувчи зот.',
    ),
    AllahName(
      number: 81,
      arabic: 'المنتقم',
      transliteration: 'ал-Мунтақим',
      meaning: 'Жазоловчи, Интиқом олувчи',
      description: 'Золим ва осийлардан интиқом олувчи.',
    ),
    AllahName(
      number: 82,
      arabic: 'العفو',
      transliteration: 'ал-Афувв',
      meaning: 'Афв қилувчи, Мағфиратли',
      description: 'Афв қилувчи.',
    ),
    AllahName(
      number: 83,
      arabic: 'الرؤوف',
      transliteration: 'ар-Ра`уф',
      meaning: 'Ўта шафқатли, Меҳрибон',
      description: 'Ўта шафқатли ва меҳрибон.',
    ),
    AllahName(
      number: 84,
      arabic: 'مالك الملك',
      transliteration: 'ал-Моликул мулк',
      meaning: 'Барча мулк Эгаси, ҳамманинг Ҳукмдори',
      description:
          'Мулк эгаси. Бу дунёдаги ишларни ўзи хоҳлаганича қилади. Унинг қазосини қайтарадиган ва ҳукмини ўзгартирадиган йўқ.',
    ),
    AllahName(
      number: 85,
      arabic: 'ذو الجلال والإكرام',
      transliteration: 'Зул жалоли вал икром',
      meaning: 'Шараф ва камол Эгаси',
      description: 'Шараф ва камол эгаси. Карам ва икром эгаси.',
    ),
    AllahName(
      number: 86,
      arabic: 'المقسط',
      transliteration: 'ал-Муқсит',
      meaning: 'Энг Адолатли, ўта Одил',
      description:
          'Ўз адолати ила мазлумларга нусрат ва золимларга жазо берувчи.',
    ),
    AllahName(
      number: 87,
      arabic: 'الجامع',
      transliteration: 'ал-Жомеъ',
      meaning: 'Жамловчи, Бириктирувчи',
      description:
          'Жамловчи. Барча ҳақиқатларни жамловчи. Одамларни қиёмат куни жамловчи.',
    ),
    AllahName(
      number: 88,
      arabic: 'الغني',
      transliteration: 'ал-Ғаний',
      meaning: 'Бой, Беҳожат',
      description: 'Беҳожат. Унинг ҳеч ким ва ҳеч нарсага ҳожати тушмайди.',
    ),
    AllahName(
      number: 89,
      arabic: 'المغني',
      transliteration: 'ал-Муғний',
      meaning: 'Беҳожат қилувчи, Ҳокатларни раво қилувчи',
      description:
          'Беҳожат қилувчи. У зот Ўз бандаларидан қай бирини хоҳласа беҳожат қилиб қўяди.',
    ),
    AllahName(
      number: 90,
      arabic: 'المانع',
      transliteration: 'ал-Монеъ',
      meaning: 'Ман қилувчи, Таъқиқловчи',
      description: 'Ман қилувчи.',
    ),
    AllahName(
      number: 91,
      arabic: 'الضار',
      transliteration: 'аз-Зорр',
      meaning: 'Зарар қилувчи, Ҳалок этувчи',
      description: 'Зарар қилувчи. Зарарли нарсаларни ҳам яратувчи.',
    ),
    AllahName(
      number: 92,
      arabic: 'النافع',
      transliteration: 'ан-Нофеъ',
      meaning: 'Наф берувчи, Манфаат ато этувчи',
      description: 'Манфаат берувчи.',
    ),
    AllahName(
      number: 93,
      arabic: 'النور',
      transliteration: 'ан-Нур',
      meaning: 'Оламларни Ёритгувчи, Мунаввар этувчи',
      description: 'Ўз-ўзи ила зоҳир бўлган ва ўзгаларни зоҳир қилган.',
    ),
    AllahName(
      number: 94,
      arabic: 'الهادي',
      transliteration: 'ал-Ҳодий',
      meaning: 'Ҳидоят қилувчи, Йўлловчи',
      description:
          'Ҳидоят қилувчи. У зот Ўз фазли ила хоҳлаган кимсани ҳидоят қилади. Яъни, Аллоҳ кимни тўғри йўлга ҳидоят қилса, албатта, Ўз хоҳиши ва фазли ила ҳидоят қилади.',
    ),
    AllahName(
      number: 95,
      arabic: 'البديع',
      transliteration: 'ал-Бадийъ',
      meaning: 'Нарсаларни ўхшашсиз, гўзал шаклда Яратувчи',
      description: 'Ўхшаши йўқ нарсаларни келтирувчи.',
    ),
    AllahName(
      number: 96,
      arabic: 'الباقي',
      transliteration: 'ал-Боқий',
      meaning: 'Боқий қилувчи, Доимий бор',
      description: 'Боқий қолувчи. У доимий бордир, унга фонийлик ориз бўлмас.',
    ),
    AllahName(
      number: 97,
      arabic: 'الوارث',
      transliteration: 'ал-Ворис',
      meaning: 'Ворис, ҳақиқий Меросхўр',
      description: 'Мувжудотлар йўқ бўлганда ҳам боқий қолувчи зот.',
    ),
    AllahName(
      number: 98,
      arabic: 'الرشيد',
      transliteration: 'ар-Рашийд',
      meaning: 'Тўгри йўлга Бошловчи, Ҳақиқат',
      description: 'Тўғри йўлга иршод қилувчи.',
    ),
    AllahName(
      number: 99,
      arabic: 'الصبور',
      transliteration: 'ас-Сабур',
      meaning: 'Ўта Сабрли',
      description: 'Ўта сабрли. Осийларни азоблашга шошилмайди.',
    ),
  ];
}

